1. ¿Qué diferencia hay entre una Serie y un DataFrame?

Que la serie tiene una dimensión y el DataFrame tiene dos dimensiones.

2. Momento de trabajar con Series. Contesta a las siguientes preguntas:

In [1]:
import pandas as pd

In [1]:
valores= [3, 8, 4, 9, 2, 1, 7]

In [3]:
indices= ["lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo"]

In [4]:
pd.Series(valores, indices)

lunes        3
martes       8
miercoles    4
jueves       9
viernes      2
sabado       1
domingo      7
dtype: int64

In [7]:
resultados= zip (indices, valores)
resultados
print (list(resultados))

[('lunes', 3), ('martes', 8), ('miercoles', 4), ('jueves', 9), ('viernes', 2), ('sabado', 1), ('domingo', 7)]

In [8]:
lista_resultados = (list(resultados))

In [11]:
diccionario = {}

for keys, values in zip (indices, valores):
    diccionario [keys] = values

In [12]:
diccionario

{'lunes': 3,
 'martes': 8,
 'miercoles': 4,
 'jueves': 9,
 'viernes': 2,
 'sabado': 1,
 'domingo': 7}

Crea una Serie a partir del diccionario.

In [14]:
Serie_diccionario =pd.Series (diccionario)

In [15]:
Serie_diccionario

lunes        3
martes       8
miercoles    4
jueves       9
viernes      2
sabado       1
domingo      7
dtype: int64

In [16]:
Serie_diccionario.shape

(7,)

In [17]:
Serie_diccionario.dtype

dtype('int64')

In [18]:
Serie_diccionario.size

7

In [19]:
Serie_diccionario.index

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

In [20]:
Serie_diccionario.values

array([3, 8, 4, 9, 2, 1, 7])

In [21]:
Serie_diccionario["lunes"]

3

In [24]:
Serie_diccionario[0:3]

lunes        3
martes       8
miercoles    4
dtype: int64

In [30]:
Serie_diccionario [0::6]

lunes      3
domingo    7
dtype: int64

In [2]:
import numpy as np

3. Es el turno de los DataFrames

In [5]:
paises= np.random.randint(0, 50, (4,3))

paises

array([[33, 29,  9],
       [20, 20, 39],
       [22,  9, 32],
       [13, 12,  9]])

In [6]:
df= pd.DataFrame(paises)

In [7]:
df.columns = ["España", "Francia", "Italia"]

df

   España  Francia  Italia
0      33       29       9
1      20       20      39
2      22        9      32
3      13       12       9

In [8]:
df_medallas= pd.read_csv("medallas.csv", index_col=1)
df_medallas

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [9]:
df_medallas.drop(columns=["Unnamed: 0"], inplace= True)
df_medallas

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

In [10]:
df_medallas.loc["Tailandia",:]

Oro       132
Plata     175
Bronce    278
Name: Tailandia, dtype: int64

In [13]:
df_medallas.loc[["China", "Irán"], :]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

In [14]:
China_Iran_medallas = df_medallas.loc[["China", "Irán"], ["Oro", "Plata", "Bronce"]]
China_Iran_medallas

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

Ahora comenzamos a usar el iloc para extraer información de la India.

In [15]:
India= df_medallas.iloc [5, :]
India

Oro       154
Plata     202
Bronce    315
Name: India, dtype: int64

Extraer todas las columnas de los países en posiciones impar.

In [17]:
posicion_impar= df_medallas.iloc [1:11:2, :]

posicion_impar

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

In [19]:
posicion_impar= df_medallas.iloc [1:11:2, 0:4]

posicion_impar

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

Contesta a las siguientes preguntas:
¿Qué país consiguió más de 200 medallas de oro?
¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [24]:

Oro = df_medallas[df_medallas["Oro"] > 200][["Oro"]].reset_index()

Oro

            País   Oro
0          China  1473
1          Japón  1032
2  Corea del Sur   745

In [28]:
df_medallas_reset = df_medallas.reset_index()

# Seleccionar el país que cumplió con las condiciones
pais_oro_plata = df_medallas_reset.loc[(df_medallas_reset["Oro"] > 200) & (df_medallas_reset["Plata"] > 1000), ["País", "Oro", "Plata"]]

# Mostrar el resultado
pais_oro_plata

    País   Oro  Plata
1  Japón  1032   1037

In [30]:
df_medallas_reset = df_medallas.reset_index()

pais_oro_bronce= df_medallas_reset.loc[(df_medallas_reset["Oro"] > 200) | (df_medallas_reset["Bronce"] > 700), ["País", "Oro", "Bronce"]]

pais_oro_bronce

            País   Oro  Bronce
0          China  1473     720
1          Japón  1032     985
2  Corea del Sur   745     827

Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [31]:
df_medallas["total"] = df_medallas[["Oro", "Plata", "Bronce"]].sum(axis=1)

In [32]:
df_medallas

                  Oro  Plata  Bronce  total
País
China            1473    994     720   3187
Japón            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Irán              179    181     197    557
Kazajistán        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taipéi       99    144     276    519
Corea del Norte    91    120     235    446